In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as phd
import seaborn as sp

In [4]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as phd

import seaborn as sp

In [5]:
name=['rohit',' kiran']
pd.DataFrame(name)

        0
0   rohit
1   kiran

In [13]:
name=['rahit','rahul']
city=['hyd','blr']
data=zip(name,city)
pd.DataFrame(data)

       0    1
0  rahit  hyd
1  rahul  blr

In [36]:
name=['rahit','rahul']
city=['hyd','blr']
age=[10,20]
G=pd.DataFrame(zip(name,city),
             index=[age],
             columns=['names','city'])

G

    names city
10  rahit  hyd
20  rahul  blr

In [28]:
G[salary]=[]

NameError: name 'salary' is not defined

In [39]:
salary=[1000,2000]
G['salary']=salary
G

    names city  salary
10  rahit  hyd    1000
20  rahul  blr    2000

In [41]:
h1=pd.DataFrame()
h1

Empty DataFrame
Columns: []
Index: []

In [42]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
h1['X']=l1
h1['Y']=l2
h1['Z']=l3
h1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

In [43]:
l4=[i**4 for i in range(1,10)]
h1['Z']=l4
h1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

In [78]:
dg=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**6 for i in range(1,10)]
l3=[i**8 for i in range(1,10)]
dg['Number']=l1
dg['Six']=l2
dg['eight']=l3

In [101]:

dg

   Number     Six     eight
0       1       1         1
1       2      64       256
2       3     729      6561
3       4    4096     65536
4       5   15625    390625
5       6   46656   1679616
6       7  117649   5764801
7       8  262144  16777216
8       9  531441  43046721

In [103]:
pf=dg.drop('eight',axis=1)

In [104]:
pf

   Number     Six
0       1       1
1       2      64
2       3     729
3       4    4096
4       5   15625
5       6   46656
6       7  117649
7       8  262144
8       9  531441

In [98]:

pf.drop([4,8,6,2])

   Number     eight
0       1         1
1       2       256
3       4     65536
5       6   1679616
7       8  16777216

In [2]:
import pandas as pd

dg=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**6 for i in range(1,10)]
l3=[i**8 for i in range(1,10)]
dg['Number']=l1
dg['Six']=l2
dg['eight']=l3

In [22]:
dg

   Number     Six     eight
0       1       1         1
1       2      64       256
2       3     729      6561
3       4    4096     65536
4       5   15625    390625
5       6   46656   1679616
6       7  117649   5764801
7       8  262144  16777216
8       9  531441  43046721

In [7]:

dg.columns[[0,1,2]]

Index(['Number', 'Six', 'eight'], dtype='object')

In [9]:

dg['eight']

0           1
1         256
2        6561
3       65536
4      390625
5     1679616
6     5764801
7    16777216
8    43046721
Name: eight, dtype: int64

In [12]:
dg['eight'].values

array([       1,      256,     6561,    65536,   390625,  1679616,
        5764801, 16777216, 43046721], dtype=int64)

In [23]:
dg.to_csv('Data.csv')

In [25]:
pd.read_csv('Data.csv')

   Unnamed: 0  Number     Six     eight
0           0       1       1         1
1           1       2      64       256
2           2       3     729      6561
3           3       4    4096     65536
4           4       5   15625    390625
5           5       6   46656   1679616
6           6       7  117649   5764801
7           7       8  262144  16777216
8           8       9  531441  43046721

In [26]:
import os
os.getcwd()

'C:\\Users\\moham\\Documents\\naresh it\\eda'